<!-- add-pr-comment:add-pr-comment -->

## Terraform plan
```

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # digitalocean_container_registry.webb_and_wallace_container_registry will be created
  + resource "digitalocean_container_registry" "webb_and_wallace_container_registry" {
      + created_at             = (known after apply)
      + endpoint               = (known after apply)
      + id                     = (known after apply)
      + name                   = "webb-and-wallace-container-registry"
      + region                 = "ams3"
      + server_url             = (known after apply)
      + storage_usage_bytes    = (known after apply)
      + subscription_tier_slug = "starter"
    }

  # digitalocean_kubernetes_cluster.billtime_k8s_cluster will be created
  + resource "digitalocean_kubernetes_cluster" "billtime_k8s_cluster" {
      + cluster_subnet       = (known after apply)
      + created_at           = (known after apply)
      + endpoint             = (known after apply)
      + ha                   = false
      + id                   = (known after apply)
      + ipv4_address         = (known after apply)
      + kube_config          = (sensitive value)
      + name                 = "billtime-k8s-cluster"
      + region               = "lon1"
      + registry_integration = false
      + service_subnet       = (known after apply)
      + status               = (known after apply)
      + surge_upgrade        = true
      + tags                 = [
          + "BillTime",
          + "staging",
          + "terraform",
        ]
      + updated_at           = (known after apply)
      + urn                  = (known after apply)
      + version              = "1.27.2-do.0"
      + vpc_uuid             = (known after apply)

      + node_pool {
          + actual_node_count = (known after apply)
          + auto_scale        = false
          + id                = (known after apply)
          + name              = "worker-pool"
          + node_count        = 2
          + nodes             = (known after apply)
          + size              = "s-1vcpu-2gb"
          + tags              = [
              + "BillTime",
              + "staging",
              + "terraform",
            ]
        }
    }

  # digitalocean_project.billtime_project will be created
  + resource "digitalocean_project" "billtime_project" {
      + created_at  = (known after apply)
      + description = "A staging environment for the billtime app."
      + environment = "Staging"
      + id          = (known after apply)
      + is_default  = false
      + name        = "billtime-staging"
      + owner_id    = (known after apply)
      + owner_uuid  = (known after apply)
      + purpose     = "Web Application"
      + resources   = (known after apply)
      + updated_at  = (known after apply)
    }

Plan: 3 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan"
Releasing state lock. This may take a few moments...

```